#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=2c03e36c-f68a-4179-bd14-22f62e7c99af]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=4acb99cc-302e-4fc7-bbed-9e575de2a635]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=c80f5534-08eb-47c7-9536-57969cd4f6ef]
module.keycloak_prod.module.custom_clients.module.test-realm.keycloak_realm.this: Refreshing state... [id=test-realm]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=b418271e-d69f-462a-8327-9cd942f5b0cb]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=a136bad0-544b-4334-8585-33510096a344]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=bae301d6-0b27-425e-8db5-ed8576501b43]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=694d0cc6-d9a1-4a57-b51d-2462fdc7e5fa]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=23633992-1062-49d0-a9ba-179c3439cb5c]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=81a91ef5-96b4-44e5-baea-ae6e15ff020d]
module.keycloak_dev.module.custom_clients.module.test-realm.keycloak_realm.this: Refreshing state... [id=test-realm]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/2c03e36c-f68a-4179-bd14-22f62e7c99af]
module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=ce3c3815-35b6-45de-b661-a945f085dbdf/c80f5534-08eb-47c7-9536-57969cd4f6ef]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client.service_account: Refreshing state... [id=1d389ae1-9f56-4b5f-92fc-3cd1d9bb2528]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group.group: Refreshing state... [id=6c70b407-6988-4822-9671-d5301150be65]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account: Refreshing state... [id=d73bb8bf-fbf6-41c3-91bc-86078474e180]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group: Refreshing state... [id=a5df3f72-b6fc-44ae-8c5f-9f004ad4a919]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group: Refreshing state... [id=f5f38878-642f-4d91-9dd1-d84aa446f9d5]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account: Refreshing state... [id=5ed68e9e-408b-4798-89b4-f2fc8e91ac38]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=6161ff73-bf84-4e6e-ade7-fb61fdbf476c]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=b3e4bf7a-07bc-4fd5-a353-a8a0f3f6c399]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=ea24227a-77d5-46cf-a759-075811d039f7]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role: Refreshing state... [id=5bed50e8-bbc8-4b07-ab8e-27898f3c5911]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=66ca7cb9-37a1-4869-9400-346073b31031/6161ff73-bf84-4e6e-ade7-fb61fdbf476c]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/23633992-1062-49d0-a9ba-179c3439cb5c]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role: Refreshing state... [id=f1f9f9ec-d4d1-4bef-bc5f-f1a26ee4ab9e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role: Refreshing state... [id=a584eb6c-9c0e-4878-a90e-6f02feb7a89e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=9a7cc670-882b-4bf0-80dc-60e7718668d8/5bed50e8-bbc8-4b07-ab8e-27898f3c5911]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/6c70b407-6988-4822-9671-d5301150be65]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/f5f38878-642f-4d91-9dd1-d84aa446f9d5]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=b2742314-9618-4e51-9c4f-41e8765da705/f1f9f9ec-d4d1-4bef-bc5f-f1a26ee4ab9e]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=7ebd38cf-dccc-474a-964a-e3bed5bf6cf2/b3e4bf7a-07bc-4fd5-a353-a8a0f3f6c399]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/a136bad0-544b-4334-8585-33510096a344]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=be7442f8-5b04-484a-b43e-30ef04e8e959/a584eb6c-9c0e-4878-a90e-6f02feb7a89e]
module.keycloak_dev.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding: Refreshing state... [id=test-realm/a5df3f72-b6fc-44ae-8c5f-9f004ad4a919]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_group_roles.role_group_binding: Refreshing state... [id=master/bae301d6-0b27-425e-8db5-ed8576501b43]
module.keycloak_prod.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding: Refreshing state... [id=173c01d6-0308-499f-abfb-fb4303761b8d/ea24227a-77d5-46cf-a759-075811d039f7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_test.module.custom_clients.module.test-realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "test-realm"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "test-realm-realm"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = "master"
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["create-client"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "create-client"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["impersonation"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "impersonation"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-events"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-realm"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["manage-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "manage-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-groups"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-groups"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-realms"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-realms"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["query-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "query-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin_master.keycloak_role.role will be updated in-place
  ~ resource "keycloak_role" "role" {
      ~ composite_roles = [
          - "0637b32f-1268-4074-b022-5b74e940e215",
          - "07cde061-36e6-4d07-8c12-b4cf5aa92580",
          - "184133ac-8478-4d92-9e09-d0551a1fcca2",
          - "1be59a80-bb46-4060-b5ae-284e94763a51",
          - "22f79828-05c1-4195-9338-5e267f2b97fb",
          - "29826e2d-d18a-439f-9cc5-408c51f25fdd",
          - "504706de-2986-43fe-8d54-96399239d42f",
          - "5f14af3f-86aa-4895-a31a-96c222d7ec14",
          - "6db74fb2-f5b0-47b9-89a4-4d89e0d0fb1d",
          - "73267923-d54a-4a80-90b1-c232da7dd039",
          - "768e69f1-7e1a-4b6d-8cf4-5afbc590e8ce",
          - "8342f51a-4913-4a2e-b3d7-43560ca564a8",
          - "9c1b5c5c-a39b-4426-be20-d4b81436e454",
          - "aa9fa883-7876-46ff-8c8d-a0929c38f05b",
          - "d6de4d96-ccbd-498f-90f2-19f1ee0ef38f",
          - "db44961b-b414-466f-932b-6c12ec81ddcc",
          - "ea73a69b-4f10-4d8e-b765-1592f80f13c1",
          - "f7060369-32f7-44bf-a91f-e74b783cccc2",
        ] -> (known after apply)
        id              = "c80f5534-08eb-47c7-9536-57969cd4f6ef"
        name            = "test-realm-realm-admin"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_clients.module.test-realm.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

Plan: 11 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*